Autodesk.Revit.DB.DirectShapeOptions.ReferencingOption
Whether or not the geometry stored in a DirectShape object may be referenced.
Remarks:
If the geometry is not referenceable, it may not be used for dimensioning, snapping, alingment, or face-hosting.
The element may still be selected by the user for operations which do not reference individual geometry objects.
The default value is Referenceable.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016